     H DFTACTGRP(*NO) ACTGRP(*NEW) OPTION(*SRCSTMT) DATEDIT(*YMD/)
     H DATFMT(*ISO) TIMFMT(*ISO)
      *=====================================================================*
      * プログラム名: RPGI2_1                                              *
      * 説明        : 登録者検索 (Pattern 1: ILE RPG / 桁制限付き自由形式)   *
      * 原型        : RPGI2.rpg (OPM RPG)                                  *
      *=====================================================================*

      *---------------------------------------------------------------------*
      * ファイル定義 (F仕様書)                                               *
      *---------------------------------------------------------------------*
     FPERSONL1  IF   E           K DISK
     FPERSON    IF   E           K DISK    RENAME(PERSONR:PERSONR2)
     FDSPF2     CF   E             WORKSTN SFILE(MEISFL:SFLRRN)
     F                                     INFDS(WSDS)

      *---------------------------------------------------------------------*
      * 変数定義 (D仕様書)                                                   *
      *---------------------------------------------------------------------*
      * サブファイル制御変数
     D SFLRRN          S              4S 0
     D TOPRRN          S              4S 0
     D RCDNUM          S              4S 0
     D DSPREC          S              4S 0